# Ang2Vec

## Description
Returns a 3-dimensional vector that is defined by the specified polar angle and length values.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION Ang2Vec(
				angleR : REAL;
				Length : REAL) : VECTOR;
```

```python

def vs.Ang2Vec(angleR, Length):
    return VECTOR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angleR|REAL|The angle of the vector (in degrees).|
|Length|REAL|The length of the vector.|

## Returns
Returns a 3-dimensional vector.

## Version
Availability: from MiniCAD
## Category
* Math - Vectors